tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/ParticleJetCases/dense/CFD/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletGas
    {
        type            zeroGradient;
    }

    InletSolidLeft
    {
        type            zeroGradient;
    }

    InletSolidRight
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    frontAndBackPlanes    
    {
        type            empty;
    }
}

// ************************************************************************* //
