tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/ParticleJetCases/dense/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.09 0 0)
    (0.09 0.09 0)
    (0 0.09 0)
    (0 0 0.18)
    (0.09 0 0.18)
    (0.09 0.09 0.18)
    (0 0.09 0.18)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 1 60) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inletGas
    (
        (0 3 2 1)
    )
    patch outlet
    (
        (4 5 6 7)
    )
    wall walls
    (
        (0 3 7 4)
        (1 5 6 2)
    )
    empty frontAndBackPlanes
    (
        (0 1 4 5)
        (2 6 7 3)  
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
