tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/ParticleJetCases/dense/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPimple;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.000005;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        writeControl   writeTime;
        fields
        (
            Us
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
		 window      1.5;
            }
            
            U
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
		 window      1.5;
            }

            voidfraction
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
		 window      1.5;
            }
            
            p
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
		 window      1.5;
            }
        );
     }

}
// ************************************************************************* //
