tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/ParticleJetCases/dense/CFD/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

		
// Patches to create.

patches
(
    {
        name InletSolidLeft;  // Name of new patch to be created 
        patchInfo
        {
           type patch;    
        }
        constructFrom set;    
        set inletFaceSetLeft;  // name of the set created in topoSet 
    }
    
    {
        name InletSolidRight;  // Name of new patch to be created 
        patchInfo
        {
           type patch;    
        }
        constructFrom set;    
        set inletFaceSetRight;  // name of the set created in topoSet 
    }    
);

// ************************************************************************* //
